doom/config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: Randy Ridenour

This is my main configuration file for Doom Emacs.

* General Settings

** Personal information

#+begin_src emacs-lisp :tangle yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
(setq user-full-name "Randy Ridenour"
      user-mail-address "rlridenour@gmail.com")
#+end_src



** Appearance

The paths for files in iCloud Drive are far too long. Unless my frame was maximized, whenever I used ~counsel-buffer-or-recentf~, I couldn't see the name of the file. After much searching, I found some code that works to shorten the paths in the minibuffer.

#+begin_src emacs-lisp :tangle yes
(use-package ivy-rich
  :after counsel
  :config
  (setq ivy-rich-display-transformers-list
        (plist-put ivy-rich-display-transformers-list
'counsel-buffer-or-recentf
    '(:columns
      (
;; (ivy-rich-file-last-modified-time (:face font-lock-comment-face))
       (counsel-buffer-or-recentf-transformer (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 1.0))))))))))
#+end_src

*** Font

I prefer a font that has some heft to it, and having tried several, I've settled for now on Droid Sans. I'm using a variant that has a slashed zero.

#+begin_src emacs-lisp :tangle yes
(setq doom-font (font-spec :family "Droid Sans Mono Slashed" :size 16)
      doom-big-font (font-spec :family "Droid Sans Mono Slashed" :size 22)
      doom-variable-pitch-font (font-spec :family "Droid Sans" :size 16))
#+end_src


** Initial screen size

I use  [[https://manytricks.com/moom/][Moom by Many Tricks]] to set window sizes on macOS. I always like them to be full-height, though.

#+begin_src emacs-lisp :tangle yes
(setq frame-resize-pixelwise t)
(add-to-list 'default-frame-alist '(fullscreen . fullheight))
#+end_src

*** Theme

The [[https://gitlab.com/protesilaos/modus-themes][modus-themes by Protesilaos Stavrou]] are highly customizable. I'm currently using the lighter theme, but it's nice to be able to switch to the darker version at night. Use ~counsel-load-theme~ (bound to ~C-h t~) to change the theme.

#+begin_src emacs-lisp :tangle yes
(use-package! modus-themes
  :init
  (setq modus-themes-slanted-constructs t
        modus-themes-bold-constructs t
        modus-themes-fringes 'intense ; {nil,'subtle,'intense}
        modus-themes-mode-line '3d ; {nil,'3d,'moody}
        modus-themes-syntax 'faint ; Lots of options---continue reading the manual
        modus-themes-intense-hl-line nil
        modus-themes-paren-match 'subtle-bold ; {nil,'subtle-bold,'intense,'intense-bold}
        modus-themes-links 'faint-neutral-underline ; Lots of options---continue reading the manual
        modus-themes-no-mixed-fonts t
        modus-themes-prompts 'intense ; {nil,'subtle,'intense}
        modus-themes-completions 'opinionated ; {nil,'moderate,'opinionated}
        modus-themes-region 'bg-only-no-extend ; {nil,'no-extend,'bg-only,'bg-only-no-extend}
        modus-themes-diffs nil ; {nil,'desaturated,'fg-only,'bg-only}
        modus-themes-org-blocks nil ; {nil,'grayscale,'rainbow}
        modus-themes-variable-pitch-headings nil
        modus-themes-scale-headings t
        modus-themes-scale-1 1.1
        modus-themes-scale-2 1.15
        modus-themes-scale-3 1.21
        modus-themes-scale-4 1.27
        modus-themes-scale-5 1.33)
  :config
  (setq doom-theme 'modus-operandi))
#+end_src

** Miscellaneous defaults

When editing two files that have the same name, it's annoying to make changes in one thinking that it was the other. This helps to distinguish them by putting their path in the buffer name. Although both items are displayed in the menu bar, it's nice to be able to see the time and battery level in the mode-line. Finally, I always want to see matching parentheses and the current line highlighted.

#+begin_src emacs-lisp :tangle yes
(setq-default
 uniquify-buffer-name-style 'forward)
(display-time-mode 1)
(display-battery-mode 1)
(show-smartparens-global-mode t)
(global-visual-line-mode t)
#+end_src

This turns off Doom's highlighting for non-standard indentation. I've re-enabled it to see what I didn't like about it.

#+begin_src emacs-lisp :tangle no
(advice-add #'doom-highlight-non-default-indentation-h :override #'ignore)
#+end_src

Don't ask for confirmation about running processes when killing Emacs.

#+begin_src emacs-lisp :tangle yes
(setq confirm-kill-processes nil)
#+end_src

* Dired

Hide various file types, mostly LaTeX auxiliary files, in Dired.

#+begin_src emacs-lisp :tangle yes
(require 'dired-x)
(setq-default dired-omit-files-p t) ; this is buffer-local variable
(setq dired-omit-files
      (concat dired-omit-files "\\|^\\..+$"))
(setq-default dired-omit-extensions '("fdb_latexmk" "aux" "bbl" "blg" "fls" "glo" "idx" "ilg" "ind" "ist" "log" "out" "gz" "bcf" "run.xml"  "DS_Store"))
(setq dired-dwim-target t)
#+end_src


* Basic editing

#+begin_src emacs-lisp :tangle yes
(load "~/Dropbox/emacs/my-emacs-abbrev")
#+end_src

Set  input method to TeX. This is especially useful for entering em and en-dashes. Turn it on with ~C-\~.

#+begin_src emacs-lisp :tangle yes
(setq default-input-method 'TeX)
#+end_src

Add my custom snippets to Yasnippet

#+begin_src emacs-lisp :tangle yes
(after! yasnippet
  (setq yas-snippet-dirs (append yas-snippet-dirs
                                 '("~/.config/doom/snippets"))))
#+end_src

Insert dates and times

#+begin_src emacs-lisp :tangle yes
(defun insert-date-string ()
  "Insert current date yyyymmdd."
  (interactive)
  (insert (format-time-string "%Y%m%d")))

(defun insert-standard-date ()
  "Inserts standard date time string."
  (interactive)
  (insert (format-time-string "%B %e, %Y")))
(global-set-key (kbd "<f8>") 'insert-standard-date)
(global-set-key (kbd "C-c d") 'insert-date-string)
#+end_src

** Spelling

#+begin_src emacs-lisp :tangle yes

(setq ispell-program-name "/usr/local/bin/aspell")
(setq ispell-extra-args '("--sug-mode=ultra"))
(setq ispell-personal-dictionary "/Users/rlridenour/Dropbox/emacs/spelling/.aspell.en.pws")
(setq ispell-silently-savep t)
#+end_src

** Scratch

Kill contents of scratch buffer, not the buffer itself. From [[http://emacswiki.org/emacs/RecreateScratchBuffer][TN]].

#+begin_src emacs-lisp :tangle yes
(defun unkillable-scratch-buffer ()
  (if (equal (buffer-name (current-buffer)) "*scratch*")
      (progn
        (delete-region (point-min) (point-max))
        nil)
    t))
(add-hook 'kill-buffer-query-functions 'unkillable-scratch-buffer)
#+end_src

Create a new scratch buffer if there isn't one, find it if there is.

#+begin_src emacs-lisp :tangle yes
(defun goto-scratch ()
  "this sends you to the scratch buffer"
  (interactive)
  (let ((goto-scratch-buffer (get-buffer-create "*scratch*")))
    (switch-to-buffer goto-scratch-buffer)
    (org-mode)))

(map! "M-g s" #'goto-scratch)
#+end_src


** Saved Keyboard Macros

Splits Org-mode list items

#+begin_src emacs-lisp :tangle yes
(fset 'split-org-item
      [?\C-k ?\M-\\ return ?\C-y])
#+end_src


#+begin_src emacs-lisp :tangle yes
(fset 'convert-markdown-to-org
      [?\M-< ?\M-% ?* return ?- return ?! ?\M-< ?\C-\M-% ?# ?* backspace backspace ?  ?# ?* ?$ return return ?! ?\M-< ?\M-% ?# return ?* return ?!])
#+end_src


* Packages

[[https://github.com/xuchunyang/grab-mac-link.el][Grab-mac-link]] is a great way to insert text into documents. I've set the "dwim" function to get the URL from the visible tab in Safari. It then formats the link correctly for the buffer's mode.

#+begin_src emacs-lisp :tangle yes
(use-package! grab-mac-link
  :defer
  :config
  (setq grab-mac-link-dwim-favourite-app 'safari)
  (map! "C-c l" #'grab-mac-link-dwim))
#+end_src

Counsel-rg is great for quick searches, but [[https://github.com/Wilfred/deadgrep][Deadgrep]] has some features that are particularly useful.

#+begin_src emacs-lisp :tangle yes
(use-package! deadgrep
  :defer)
#+end_src

#+begin_src emacs-lisp :tangle no
(map! :leader
      (:desc "search" :prefix "s"
       :desc "Deadgrep" "g" #'deadgrep)
      )
#+end_src

Hungry delete deletes consecutive whitespace.

#+begin_src emacs-lisp :tangle yes
(use-package! hungry-delete
  :defer
  :config
  (global-hungry-delete-mode))
#+end_src

The Shrink Whitespace package reduces all whitespace surrounding the point to one empty line or space when called once. When called again, it also eliminates that bit of whitespace.

#+begin_src emacs-lisp :tangle yes
(use-package! shrink-whitespace
  :defer)
(map! "C-M-s-d" #'shrink-whitespace)
#+end_src

Use ebib for bibtex file management

#+begin_src emacs-lisp :tangle yes
(use-package! ebib
:defer
:config
(setq ebib-bibtex-dialect 'biblatex)
:custom
(ebib-preload-bib-files '("~/bibtex/rlr-bib/rlr.bib")))
#+end_src


* Languages

