doom/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
(setq user-full-name "Randy Ridenour"
      user-mail-address "rlridenour@gmail.com")

(setq doom-font (font-spec :family "Droid Sans Mono Slashed" :size 16)
      doom-big-font (font-spec :family "Droid Sans Mono Slashed" :size 22)
      doom-variable-pitch-font (font-spec :family "Droid Sans" :size 16))

(setq frame-resize-pixelwise t)
(add-to-list 'default-frame-alist '(fullscreen . fullheight))

(use-package! modus-themes
  :init
  (setq modus-themes-slanted-constructs t
        modus-themes-bold-constructs t
        modus-themes-fringes 'intense ; {nil,'subtle,'intense}
        modus-themes-mode-line '3d ; {nil,'3d,'moody}
        modus-themes-syntax 'faint ; Lots of options---continue reading the manual
        modus-themes-intense-hl-line nil
        modus-themes-paren-match 'subtle-bold ; {nil,'subtle-bold,'intense,'intense-bold}
        modus-themes-links 'faint-neutral-underline ; Lots of options---continue reading the manual
        modus-themes-no-mixed-fonts t
        modus-themes-prompts 'intense ; {nil,'subtle,'intense}
        modus-themes-completions 'opinionated ; {nil,'moderate,'opinionated}
        modus-themes-region 'bg-only-no-extend ; {nil,'no-extend,'bg-only,'bg-only-no-extend}
        modus-themes-diffs nil ; {nil,'desaturated,'fg-only,'bg-only}
        modus-themes-org-blocks nil ; {nil,'grayscale,'rainbow}
        modus-themes-variable-pitch-headings nil
        modus-themes-scale-headings t
        modus-themes-scale-1 1.1
        modus-themes-scale-2 1.15
        modus-themes-scale-3 1.21
        modus-themes-scale-4 1.27
        modus-themes-scale-5 1.33)
  :config
  (setq doom-theme 'modus-operandi))

(setq-default
 uniquify-buffer-name-style 'forward)
(display-time-mode 1)
(display-battery-mode 1)
(show-smartparens-global-mode t)
(global-visual-line-mode t)

(setq confirm-kill-processes nil)

(require 'dired-x)
(setq-default dired-omit-files-p t) ; this is buffer-local variable
(setq dired-omit-files
      (concat dired-omit-files "\\|^\\..+$"))
(setq-default dired-omit-extensions '("fdb_latexmk" "aux" "bbl" "blg" "fls" "glo" "idx" "ilg" "ind" "ist" "log" "out" "gz" "bcf" "run.xml"  "DS_Store"))
(setq dired-dwim-target t)

(load "~/Dropbox/emacs/my-emacs-abbrev")

(setq default-input-method 'TeX)

(after! yasnippet
  (setq yas-snippet-dirs (append yas-snippet-dirs
                                 '("~/.config/doom/snippets"))))

(defun insert-date-string ()
  "Insert current date yyyymmdd."
  (interactive)
  (insert (format-time-string "%Y%m%d")))

(defun insert-standard-date ()
  "Inserts standard date time string."
  (interactive)
  (insert (format-time-string "%B %e, %Y")))
(global-set-key (kbd "<f8>") 'insert-standard-date)
(global-set-key (kbd "C-c d") 'insert-date-string)

(setq ispell-program-name "/usr/local/bin/aspell")
(setq ispell-extra-args '("--sug-mode=ultra"))
(setq ispell-personal-dictionary "/Users/rlridenour/Dropbox/emacs/spelling/.aspell.en.pws")
(setq ispell-silently-savep t)

(defun unkillable-scratch-buffer ()
  (if (equal (buffer-name (current-buffer)) "*scratch*")
      (progn
        (delete-region (point-min) (point-max))
        nil)
    t))
(add-hook 'kill-buffer-query-functions 'unkillable-scratch-buffer)

(defun goto-scratch ()
  "this sends you to the scratch buffer"
  (interactive)
  (let ((goto-scratch-buffer (get-buffer-create "*scratch*")))
    (switch-to-buffer goto-scratch-buffer)
    (org-mode)))

(map! "M-g s" #'goto-scratch)

(fset 'split-org-item
      [?\C-k ?\M-\\ return ?\C-y])

(fset 'convert-markdown-to-org
      [?\M-< ?\M-% ?* return ?- return ?! ?\M-< ?\C-\M-% ?# ?* backspace backspace ?  ?# ?* ?$ return return ?! ?\M-< ?\M-% ?# return ?* return ?!])

(use-package! grab-mac-link
  :defer
  :config
  (setq grab-mac-link-dwim-favourite-app 'safari)
  (map! "C-c l" #'grab-mac-link-dwim))

(use-package! deadgrep
  :defer)

(use-package! hungry-delete
  :defer
  :config
  (global-hungry-delete-mode))

(use-package! shrink-whitespace
  :defer)
(map! "C-M-s-d" #'shrink-whitespace)

(use-package! ebib
:defer
:config
(setq ebib-bibtex-dialect 'biblatex)
:custom
(ebib-preload-bib-files '("~/bibtex/rlr-bib/rlr.bib")))
