doom/config.org
** Org Mode


Set default directory for Org files.

#+begin_src emacs-lisp :tangle yes
(setq org-directory "~/Library/Mobile Documents/com~apple~CloudDocs/org/")
#+end_src

Don't use Org Indent mode

#+begin_src emacs-lisp :tangle yes
(after! org (setq org-startup-indented nil
                  org-adapt-indentation nil))
#+end_src

Make all the stars visible in Org headings.

#+begin_src emacs-lisp :tangle yes
(after! org (setq org-hide-leading-stars nil))
#+end_src

Set location of Org agenda files.

#+begin_src emacs-lisp :tangle yes
(after! org (setq org-agenda-files '("/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/org/tasks/")))
#+end_src

Doom, by default, inserts Org headings after the current subtree. Instead, insert the heading at the current point.

#+begin_src emacs-lisp :tangle yes
(after! org (setq org-insert-heading-respect-content nil))
#+end_src

Make some Org-capture templates. Here's one for quickly making todo items.

#+begin_src emacs-lisp :tangle no
(setq org-capture-templates
      '(("t" "Todo" entry (file+headline "/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/org/tasks/tasks.org" "Tasks")
         "* TODO %?\n  %i\n  %a")
        ;; ("j" "Journal" entry (file+datetree "~/Dropbox/Org/journal.org")
        ;;  "* %?\nEntered on %U\n  %i\n  %a")
        )
      )
#+end_src

#+begin_src emacs-lisp :tangle yes
(add-hook! 'org-mode-hook #'+org-pretty-mode #'mixed-pitch-mode)
#+end_src

Easily insert structural blocks in Org mode. For example, ~C-c C-, q~ inserts a quote block.

#+begin_src emacs-lisp :tangle yes
(require 'org-tempo)
#+end_src


Enable ignoring a headline during export. I was using this to hide the settings in Org files; now I use a drawer instead.

#+begin_src emacs-lisp :tangle yes
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))
#+end_src

Count words in Org files.

#+begin_src emacs-lisp :tangle yes
(add-hook 'org-mode-hook 'wc-mode)
#+end_src


#+begin_src emacs-lisp :tangle no
(defun flyspell-ignore-tex ()
  (interactive)
  (set (make-variable-buffer-local 'ispell-parser) 'tex))
(add-hook 'org-mode-hook (lambda () (setq ispell-parser 'tex)))
(add-hook 'org-mode-hook 'flyspell-ignore-tex)
#+end_src

Set location of default bibliography file.

#+begin_src emacs-lisp :tangle yes
(use-package! org-ref
  :after org
  :init
  (setq org-ref-completion-library 'org-ref-ivy-cite
        org-ref-default-bibliography '("~/bibtex/rlr-bib/rlr.bib")))
#+end_src

Return adds new heading or list item. From [[https://github.com/aaronjensen/emacs-orgonomic][Aaron Jensen]]


#+begin_src emacs-lisp :tangle yes
(use-package! orgonomic
  :after org
  :hook (org-mode . orgonomic-mode))
#+end_src

I have some scripts for automating lecture notes and slides. This function exports the slide and notes files to LaTeX, then uses Arara to compile them to PDF. After completing, it returns to the data file.

#+begin_src emacs-lisp :tangle yes
(defun lecture-slides ()
  "publish org file as beamer slides and notes"
  (interactive)
  (find-file "*-slides.org" t)
  (org-beamer-export-to-latex)
  (kill-buffer)
  (find-file "*-notes.org" t)
  (org-beamer-export-to-latex)
  (kill-buffer)
  (arara-all)
  (find-file "*-data.org" t))
#+end_src

The university uses Canvas for its learning management system. Surprisingly, Canvas doesn't offer the ability to edit in Markdown — the only two options are using a rich text editor, which forces one to constantly use the mouse, or to edit the page in HTML.  This function exports the Org file to HTML, then runs a shell script that converts the exported HTML to a format that Canvas likes, copies it to the clipboard, then deletes the HTML file.

#+begin_src emacs-lisp :tangle yes
(defun canvas-copy ()
  "Copy html for canvas pages"
  (interactive)
  (org-html-export-to-html)
  (shell-command "canvas")
  )
#+end_src

Here are some export settings for LaTeX. I prefer to not use any default packages, and instead, specify all packages in the file settings.

#+begin_src emacs-lisp :tangle yes
(require 'ox-latex)

(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
               '("org-article"
                 "\\documentclass{article}
      [NO-DEFAULT-PACKAGES]
      [NO-PACKAGES]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  (add-to-list 'org-latex-classes
               '("org-handout"
                 "\\documentclass{obuhandout}
      [NO-DEFAULT-PACKAGES]
      [NO-PACKAGES]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  (add-to-list 'org-latex-classes
               '("org-beamer"
                 "\\documentclass{beamer}
      [NO-DEFAULT-PACKAGES]
      [NO-PACKAGES]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  )

#+end_src

OBU letter

#+begin_src emacs-lisp :tangle yes
(add-to-list 'org-latex-classes
             '("rlr-obu-letter"
               "\\documentclass[12pt]{obuletter}

  % Customize variables --- for the entire list, see obuletter.cls and myletter.cls.
  \\newcommand{\\obuDept}{Department of Philosophy} % For personal letterhead, use name here.
  \\newcommand{\\Sender}{Randy Ridenour, Ph.D.}
  \\newcommand{\\obuTitle}{Professor of Philosophy}
  \\newcommand{\\obuCollege}{Hobbs College of Theology and Ministry} % For personal letterhead, use title here.
  \\newcommand{\\obuPhone}{405.585.4432}
  \\newcommand{\\obuFax}{405.878.2401}
  \\newcommand{\\closing}{Sincerely,}
  \\newcommand{\\toName}{Recipient}
  \\newcommand{\\toAddress}{Street Address\\\\City, State ZIP}

          [NO-DEFAULT-PACKAGES]
          [NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+end_src

Personal letter

#+begin_src emacs-lisp :tangle yes
(add-to-list 'org-latex-classes
             '("rlr-personal-letter"
               "\\documentclass[12pt]{myletter}

  % Customize variables --- for the entire list, see obuletter.cls and myletter.cls.
  \\newcommand{\\Sender}{Randy Ridenour}
  \\newcommand{\\closing}{Sincerely,}
  \\newcommand{\\toName}{Recipient}
  \\newcommand{\\toAddress}{Street Address\\\\City, State ZIP}

          [NO-DEFAULT-PACKAGES]
          [NO-PACKAGES]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+end_src

#+BEGIN_SRC emacs-lisp :tangle no
(after! org
  (set-company-backend! 'org-mode nil))
#+END_SRC

Company mode was annoying me by forcing results to be in lower case when I had begun a capitalized word. So, I've increased the delay before the completion tips show.

#+begin_src emacs-lisp :tangle yes
(setq company-idle-delay 1.0)
#+end_src




**

*** Org Roam
#+begin_src emacs-lisp :tangle yes
(use-package! deft
  :after org
  :bind
  ("C-c n d" . deft)
  :custom
  (deft-recursive t)
  (deft-use-filename-as-title nil)
  (deft-use-filter-string-for-filename t)
  (deft-extensions '("org" "md" "txt"))
  (deft-file-naming-rules '((noslash . "-")
                            (nospace . "-")
                            (case-fn . downcase)))
  (deft-default-extension "org")
  (deft-directory "/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/org/notes/"))

(use-package! org-roam
  :hook
  (after-init . org-roam-mode)
  :custom
  (org-roam-directory (file-truename "/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/org/roam/"))
  :bind (:map org-roam-mode-map
         (("C-c n l" . org-roam)
          ("C-c n f" . org-roam-find-file)
          ("C-c n g" . org-roam-graph))
         :map org-mode-map
         (("C-c n i" . org-roam-insert))
         (("C-c n I" . org-roam-insert-immediate))))

(setq org-roam-capture-templates
      '(("d" "default" plain (function org-roam-capture--get-point)
         "%?"
         :file-name "%<%Y%m%d%H%M%S>-${slug}"
         :head "#+title: ${title}\n#+ROAM_TAGS: \n"
         :unnarrowed t)))

(setq org-roam-dailies-directory "daily/")

(setq org-roam-dailies-capture-templates
      '(("d" "default" entry
         #'org-roam-capture--get-point
         "* %?"
         :file-name "daily/%<%Y-%m-%d>"
         :head "#+title: %<%Y-%m-%d>\n\n")))
#+end_src



