doom/config.org
* Hugo

#+begin_src emacs-lisp :tangle yes
(use-package! ox-hugo
  :after org
  :init
  (setq org-hugo-delete-trailing-ws nil
        org-hugo-auto-set-lastmod t
org-hugo-suppress-lastmod-period 86400.0))
#+end_src

Create new blog post for ox-hugo.

Set some variables to use.

#+begin_src emacs-lisp :tangle yes
(defvar hugo-directory "~/Sites/blog/" "Path to Hugo blog.")
(defvar hugo-posts-dir "content/posts/" "Relative path to posts directory.")
#+end_src

Use this function to create a new post when in the main blog content Org file.

#+begin_src emacs-lisp :tangle yes
(defun hugo-make-slug (s) "Turn a string into a slug."
       (replace-regexp-in-string " " "-"  (downcase (replace-regexp-in-string "[^A-Za-z0-9 ]" "" s))))

(defun new-post (title) "Create a new blog post."
       (interactive "sPost Title: ")
       (insert "** TODO " title"\n:PROPERTIES:\n:EXPORT_FILE_NAME: "(format-time-string "%Y%m%d-")(hugo-make-slug title)"\n:EXPORT_DATE "(format-time-string "%Y-%m-%d")"\n:END:\n\n"))
#+end_src


Org-capture template for a blog post. ~C-c n n~ opens a window with the new post, and ~C-c C-c~ closes the window and adds the new post to the Blog Ideas section of blog.org.

#+begin_src emacs-lisp :tangle yes
;; Populates only the EXPORT_FILE_NAME property in the inserted headline.
(with-eval-after-load 'org-capture
  (defun org-hugo-new-subtree-post-capture-template ()
    "Returns `org-capture' template string for new Hugo post.
  See `org-capture-templates' for more information."
    (let* ((title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
           (fname (org-hugo-slug title)))
      (mapconcat #'identity
                 `(
                   ,(concat "* TODO " title)
                   ":PROPERTIES:"
                   ,(concat ":EXPORT_FILE_NAME: " (format-time-string "%Y%m%d-") fname)
                   ,(concat ":EXPORT_DATE: " (format-time-string "%Y-%m-%dT%H:%M:%S"))
                   ":END:"
                   "%?\n")          ;Place the cursor here finally
                 "\n")))

  (add-to-list 'org-capture-templates
               '("h"                ;`org-capture' binding + h
                 "Hugo post"
                 entry
                 ;; It is assumed that below file is present in `org-directory'
                 ;; and that it has a "Blog Ideas" heading. It can even be a
                 ;; symlink pointing to the actual location of all-posts.org!
                 (file+olp "blog.org" "Blog Ideas")
                 (function org-hugo-new-subtree-post-capture-template))))
#+end_src

Update post date.

#+begin_src emacs-lisp :tangle yes
(defun hugo-timestamp ()
  "Update existing date: timestamp on a Hugo post."
  (interactive)
  (save-excursion (
                   re-search-forward "^:EXPORT_DATE:")
                  (let ((beg (point)))
                    (end-of-line)
                    (delete-region beg (point)))
                  (insert (concat " " (format-time-string "%Y-%m-%dT%H:%M:%S")))))
#+end_src

Deploy Hugo blog.

#+begin_src emacs-lisp :tangle yes
(defmacro with-dir (DIR &rest FORMS)
  "Execute FORMS in DIR."
  (let ((orig-dir (gensym)))
    `(progn (setq ,orig-dir default-directory)
            (cd ,DIR) ,@FORMS (cd ,orig-dir))))

(defun hugo-deploy ()
  "Push changes upstream."
  (interactive)
  (with-dir hugo-directory
            (shell-command "git add .")
            (--> (current-time-string)
                 (concat "git commit -m \"" it "\"")
                 (shell-command it))
            (magit-push-current-to-upstream nil)))

#+end_src

Enable Org-ref citations in Ox-hugo. Not working yet.

#+begin_src emacs-lisp :tangle no
(use-package! citeproc-org
  :after ox-hugo
  :config
  (citeproc-org-setup))
#+end_src

* Keybindings

Unset some keys

#+begin_src emacs-lisp :tangle yes
(global-unset-key (kbd "C-z"))
(global-unset-key (kbd "s-p"))
(global-unset-key (kbd "s-m"))
(global-unset-key (kbd "s-h"))
(global-unset-key (kbd "s-w"))
#+end_src


