doom/config.org
** Misc Keybindings


#+begin_src emacs-lisp :tangle yes
(map!
 ("<s-backspace>" 'kill-whole-line)
 ("<s-up>"  'beginning-of-buffer)
 ("<s-down>" 'end-of-buffer))
#+end_src

Use ~s-r~ to select buffers and recent files, ~s-b~ to switch buffers including system buffers.

#+begin_src emacs-lisp :tangle yes
(map! "s-b" #'counsel-switch-buffer
      "s-r" #'counsel-buffer-or-recentf)
#+end_src

Use evil-nerd-commenter for comments.

#+begin_src emacs-lisp :tangle yes
(map! "M-;" #'evilnc-comment-or-uncomment-lines)
#+end_src

Replace ~goto-line~ with ~avy-goto-line~. ~Avy-goto-char-timer~ is an efficient way to go to a specific location in the visible text.

#+begin_src emacs-lisp :tangle yes
(map! "M-g g" #'avy-goto-line
      "M-g M-g" #'avy-goto-line
      "s-/" #'avy-goto-char-timer)
#+end_src


#+begin_src emacs-lisp :tangle yes
(map! "M-g o" #'counsel-outline)
#+end_src

#+begin_src emacs-lisp :tangle yes
(map! "s-o" #'counsel-find-file)
#+end_src

* Final Steps

#+begin_src emacs-lisp :tangle yes
(setq default-directory "~/")
#+end_src
