doom/config.el
 ("<s-backspace>" 'kill-whole-line)
 ("<s-up>"  'beginning-of-buffer)
 ("<s-down>" 'end-of-buffer))

(map! "s-b" #'counsel-switch-buffer
      "s-r" #'counsel-buffer-or-recentf)

(map! "M-;" #'evilnc-comment-or-uncomment-lines)

(map! "M-g g" #'avy-goto-line
      "M-g M-g" #'avy-goto-line
      "s-/" #'avy-goto-char-timer)

(map! "M-g o" #'counsel-outline)

(map! "s-o" #'counsel-find-file)

(setq default-directory "~/")
